[
  {
    "teamName": "Team Flaming Garbage",
    "description": "It appears that the wet spring wasn't moist enough to dampen this garbage can. Carried by Sammy \"I am only playing because Kareem isn't\" Watkins Reed was the highest scorer this week continuing a solid run last year. This doesn't mean that his team looks particularly amazing as his bench lived up to his team's name. Cam Newton also looked like he was trying to play tiddly winks instead of football scoring just 5 points. Overall Reedo looks good but time will tell if that continues.",
    "record": "1-0",
    "managerName": "Reed Salmon"
  },
  {
    "teamName": "(Foot) ball Dandruff",
    "description": "Much like Reed's team, the Dandruff sniffers looked pretty starter heavy. One caveat there is that one of my star players is banging hookers in Tijuana instead of playing football. Gordon if you are reading this please come back to the Chargers, you don't want the diseases those beautiful ladies have down there! This week truly showed how important quarterbacks are going to be in this league because having two below average throwers means that your team is likely going to struggle.",
    "record": "1-0",
    "managerName": "Ryan Trapp"
  },
  {
    "teamName": "Straight Snoozing",
    "description": "Straight Sleeping Her Way To The Top surprised the world by getting a win against the defending champ in her first fantasy football game ever. Apparently drafting two QB's early and then picking up a kicker 4 rounds before anyone else is the strat we should all be using. Greg The Third Leg Zuerlein proved his worth by scoring 14 points. While her starters looked good, her bench looked solid as well. Jamison Clam Chowder and Larry \"I Will Never Retire\" Fitzgerald both put up impressive weeks. Look for Maddy to continue to sleep her way up these rankings as the season progresses.",
    "record": "1-0",
    "managerName": "Maddy Dopp"
  },
  {
    "teamName": "Big City Slams",
    "description": "The Big City Slam Me Daddies rode Christian McCafe Coffee to a solid win. While they were pretty top heavy in their top performers, the slams were fairly consistent all the way through their roster. Matt Prater did his thing and scored some solid points as well. I personally hope this team sucks so we don't have to deal with Cole winning anything as we all know how that will affect his ego.",
    "record": "1-0",
    "managerName": "Cole Konczal"
  },
  {
    "teamName": "Average Joe's",
    "description": "Tough loss for the Joes to start the season. Also even after I made fun of him last year, Evan still insists on bastardizing the english and having an apostrophe in his team's name. You see what I did there? Apostrophes show possession not plurality you illiterate fuck.  Your team looked average all around which got you close to winning, but just like your team's name, you fell short of your goal. ",
    "record": "0-1",
    "managerName": "Evan Blackwell"
  },

  {
    "teamName": "Dan Grizzly",
    "description": "Dan \"The Better Looking Brother\" Grizzly started the league off on the right foot. Led by the absolutely show stopping performance of Kurt Cousins going 8/10 with 98 yards he was able to beat his younger and less intelligent brother to start the season. While he did get the win, his team did not look too dominant and doesn't have the star power some of the other teams have. I expect an average season to start Bear's career in this league.",
    "record": "1-0",
    "managerName": "Joe Cropsey"
  },
  {
    "teamName": "Club Menergy",
    "description": "Tough loss for Mr. Renewable Menergy as his team did not look truly terrible like some of the other teams below him. T.Y. Hilton somehow put up a good game even those his QB yeeted himself out of the league right before the season. One bright spot on his team was Robby Anderson on his bench who looks like the old school Nickelodeon logo which I believe is going to be crucial to this club's success in the long run.",
    "record": "0-1",
    "managerName": "Mark Lapointe"
  },
  {
    "teamName": "False Causality",
    "description": "We all saw it coming as Mr. Fake Intellectualism started the year off with a loss to Mr. Colorado Oil Barren. It seems that waiting to pick up a QB and ending up with Josh Rosen and Daniel Jones as backups could not have worked out less for him. With such bad QB's one would assume that his running backs would perform better but Gabe proved all the believers wrong. Bad start for a solid team last year, lets see if he turns it around.",
    "record": "0-1",
    "managerName": "Gabe Madson"
  },
  {
    "teamName": "Benson Burner",
    "description": "Rough start for Trogdor the Burninator with a loss to someone who knows nothing about football other than that she likes the pants they wear.  Mitch \"Big Titty\" Trubisky looked abysmal and Big Dick Nick is out so he is looking lost at the QB slot.  Lamar Jackson had the game of his life but that couldn't get Burn Boi the win as the rest of his team couldn't even score more than 15 points. One has to wonder if Connor even likes football after seeing his performance this week. There doesn't look like an obvious route out of the bottom for this team.",
    "record": "0-1",
    "managerName": "Connor Benson"
  },
  {
    "teamName": "Canada Gooses",
    "description": "I would love to say that the Geese are down here because they ran into a superior team but while that might be true, they just laid an egg. With just a single player scoring more than 15 points, there just wasn't really any bright spots this week for the Goslings. If this continues everyone that plays them will be having a lot Goose feasts and the birdies won't be getting many win(g)s. ",
    "record": "0-1",
    "managerName": "Mariah Gallagher"
  }
]
